# pandas.DataFrame

In [2]:
import pandas as pd
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [7]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df = pd.DataFrame(data, columns=['id'])
df

   id
0   1
1   2
2   3
3   4
4   5

In [14]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data, columns=['Name','Age'], dtype=float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [15]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
data

{'Name': ['Tom', 'Jack', 'Steve', 'Ricky'], 'Age': [28, 34, 29, 42]}

In [17]:
df = pd.DataFrame(data, index=[100,1001,102,105])
df

       Name  Age
100     Tom   28
1001   Jack   34
102   Steve   29
105   Ricky   42

In [21]:
data = {'id': [101], 'grade': ['A']}
df = pd.DataFrame(data)
df

    id grade
0  101     A

### Create a DataFrame from List of Dicts

In [25]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, columns=['a', 'b', 'c'])
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

## Create a DataFrame from Dict of Series

In [26]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [27]:
df = pd.DataFrame(d)

In [28]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

### Column Addition

In [29]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [34]:
df['three'] = pd.Series([10,20,30], index=['a','b','c'])

In [35]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [36]:
df['four']= df['one']+df['three']

In [37]:
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [38]:
# using del function
del df['four']
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [39]:
df['four']= df['one']+df['three']
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [40]:
# using pop function
df.pop('three')

a    10.0
b    20.0
c    30.0
d     NaN
Name: three, dtype: float64

In [41]:
df

   one  two  four
a  1.0    1  11.0
b  2.0    2  22.0
c  3.0    3  33.0
d  NaN    4   NaN

### Row Selection, Addition, and Deletion

In [44]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [46]:
row = df.loc['b']
row

one    2.0
two    2.0
Name: b, dtype: float64

In [49]:
row['one']

2.0

In [50]:
df.iloc[2]

one    3.0
two    3.0
Name: c, dtype: float64

### Addition of Rows

In [54]:
df = pd.DataFrame([[1,2], [3,4]], columns = ['a', 'b'])
df2 = pd.DataFrame([[5,6], [7,8]], columns = ['a', 'b'])
df

   a  b
0  1  2
1  3  4

In [55]:
df2

   a  b
0  5  6
1  7  8

In [56]:
df = df.append(df2)

In [57]:
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [ ]:
# Drop with label 
df = df.drop(0)